//
// Created by Stefan Andonov on 11/18/20.
//

/*
 * Да се напише програма која ќе ги отпечати сите непарни броеви помеѓу М и N (М и N се внесуваат од тастатура, N > M > 10), без М и N, кои се деливи со збирот на нивните две најмалку значајни цифри.

Забелешка: Во сите тест примери секогаш ќе има барем еден непарен број помеѓу M и N што го задоволува бараниот услов.*/

#include<stdio.h>
int main () {
    int M,N, i;

    scanf("%d %d", &M, &N);

    for (i=M+1;i<N;i++) {
        int zbirDvePosledni = i%10 + i/10%10;
        if (i%2 && i%zbirDvePosledni==0) {
            printf("%d\n", i);
        }
    }
    return 0;
}